In [5]:
import pymysql
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
df_BANK_marketing = pd.read_parquet('df_BANK_marketing.parquet')
df_BANK_marketing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11163 entries, 0 to 11162
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             11163 non-null  int64
 1   age            11163 non-null  float64
 2   job            11163 non-null  object
 3   marital        11163 non-null  object
 4   education      11163 non-null  object
 5   is_in_default  11163 non-null  int64
 6   balance        11163 non-null  int64
 7   housing        11163 non-null  int64
 8   loan           11163 non-null  int64
 9   contact        11163 non-null  object
 10  day            11163 non-null  int64
 11  month          11163 non-null  object
 12  duration       11163 non-null  int64
 13  campaign       11163 non-null  int64
 14  pdays          11163 non-null  int64
 15  previous       11163 non-null  int64
 16  poutcome       11163 non-null  object
 17  deposit        11163 non-null  int64
dtypes: float64(1), int64(11), object(6)
memory usage: 1.5+ MB

## EDA (Exploratory Data Analisis)

Procedemos a revisar nuestro dataframe para observar posibles anomalias.

In [14]:
df_finanzas = df_BANK_marketing[['id','age','job','marital','is_in_default','balance','housing','loan']]
df_finanzas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11163 entries, 0 to 11162
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             11163 non-null  int64
 1   age            11163 non-null  float64
 2   job            11163 non-null  object
 3   marital        11163 non-null  object
 4   is_in_default  11163 non-null  int64
 5   balance        11163 non-null  int64
 6   housing        11163 non-null  int64
 7   loan           11163 non-null  int64
dtypes: float64(1), int64(5), object(2)
memory usage: 697.8+ KB

In [15]:
df_finanzas.shape

(11163, 8)

In [16]:
df_finanzas.head()

   id   age         job  marital  is_in_default  balance  housing  loan
0   1  59.0      admin.  married              0     2343        1     0
1   2  59.0      admin.  married              0     2343        1     0
2   3  56.0      admin.  married              0       45        0     0
3   4  41.0  technician  married              0     1270        1     0
4   5  55.0    services  married              0     2476        1     0

Vemos que el dataframe está correcto y preparado para empezar con el análisis.

In [19]:
df_finanzas.describe().round()

            id      age  is_in_default  balance  housing     loan
count  11163.0  11163.0        11163.0  11163.0  11163.0  11163.0
mean    5582.0     41.0            0.0   1529.0      0.0      0.0
std     3223.0     12.0            0.0   3225.0      0.0      0.0
min        1.0     18.0            0.0  -6847.0      0.0      0.0
25%     2792.0     32.0            0.0    122.0      0.0      0.0
50%     5582.0     39.0            0.0    550.0      0.0      0.0
75%     8372.0     49.0            0.0   1708.0      1.0      0.0
max    11163.0     95.0            1.0  81204.0      1.0      1.0